espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dw_gdma_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Version Register */
/** Type of id0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_id : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dmac_id: 32;
    };
    uint32_t val;
} dmac_id0_reg_t;

/** Type of compver0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_compver : RO; bitpos: [31:0]; default: 842018858;
         *  NA
         */
        uint32_t dmac_compver: 32;
    };
    uint32_t val;
} dmac_compver0_reg_t;

/** Group: Configuration Registers */
/** Type of cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t dmac_en: 1;
        /** int_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t int_en: 1;
        uint32_t reserved_2: 30;
    };
    uint32_t val;
} dmac_cfg0_reg_t;

/** Type of chen0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_en: 1;
        /** ch2_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_en: 1;
        /** ch3_en : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_en: 1;
        /** ch4_en : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_en: 1;
        uint32_t reserved_4: 4;
        /** ch1_en_we : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch1_en_we: 1;
        /** ch2_en_we : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch2_en_we: 1;
        /** ch3_en_we : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch3_en_we: 1;
        /** ch4_en_we : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch4_en_we: 1;
        uint32_t reserved_12: 4;
        /** ch1_susp : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t ch1_susp: 1;
        /** ch2_susp : R/W; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t ch2_susp: 1;
        /** ch3_susp : R/W; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t ch3_susp: 1;
        /** ch4_susp : R/W; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t ch4_susp: 1;
        uint32_t reserved_20: 4;
        /** ch1_susp_we : WO; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t ch1_susp_we: 1;
        /** ch2_susp_we : WO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t ch2_susp_we: 1;
        /** ch3_susp_we : WO; bitpos: [26]; default: 0;
         *  NA
         */
        uint32_t ch3_susp_we: 1;
        /** ch4_susp_we : WO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t ch4_susp_we: 1;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} dmac_chen0_reg_t;

/** Type of chen1 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_abort : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_abort: 1;
        /** ch2_abort : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_abort: 1;
        /** ch3_abort : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_abort: 1;
        /** ch4_abort : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_abort: 1;
        uint32_t reserved_4: 4;
        /** ch1_abort_we : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t ch1_abort_we: 1;
        /** ch2_abort_we : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t ch2_abort_we: 1;
        /** ch3_abort_we : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t ch3_abort_we: 1;
        /** ch4_abort_we : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t ch4_abort_we: 1;
        uint32_t reserved_12: 20;
    };
    uint32_t val;
} dmac_chen1_reg_t;

/** Type of reset0 register
 *  NA
 */
typedef union {
    struct {
        /** dmac_rst : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t dmac_rst: 1;
        uint32_t reserved_1: 31;
    };
    uint32_t val;
} dmac_reset0_reg_t;

/** Type of lowpower_cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** gbl_cslp_en : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t gbl_cslp_en: 1;
        /** chnl_cslp_en : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t chnl_cslp_en: 1;
        /** sbiu_cslp_en : R/W; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t sbiu_cslp_en: 1;
        /** mxif_cslp_en : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t mxif_cslp_en: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} dmac_lowpower_cfg0_reg_t;

/** Type of lowpower_cfg1 register
 *  NA
 */
typedef union {
    struct {
        /** glch_lpdly : R/W; bitpos: [7:0]; default: 64;
         *  NA
         */
        uint32_t glch_lpdly: 8;
        /** sbiu_lpdly : R/W; bitpos: [15:8]; default: 64;
         *  NA
         */
        uint32_t sbiu_lpdly: 8;
        /** mxif_lpdly : R/W; bitpos: [23:16]; default: 64;
         *  NA
         */
        uint32_t mxif_lpdly: 8;
        uint32_t reserved_24: 8;
    };
    uint32_t val;
} dmac_lowpower_cfg1_reg_t;

/** Type of chn_sar0 register
 *  NA
 */
typedef union {
    struct {
        /** sar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t sar0: 32;
    };
    uint32_t val;
} dmac_chn_sar0_reg_t;

/** Type of chn_sar1 register
 *  NA
 */
typedef union {
    struct {
        /** sar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t sar1: 32;
    };
    uint32_t val;
} dmac_chn_sar1_reg_t;

/** Type of chn_dar0 register
 *  NA
 */
typedef union {
    struct {
        /** dar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dar0: 32;
    };
    uint32_t val;
} dmac_chn_dar0_reg_t;

/** Type of chn_dar1 register
 *  NA
 */
typedef union {
    struct {
        /** dar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dar1: 32;
    };
    uint32_t val;
} dmac_chn_dar1_reg_t;

/** Type of chn_block_ts0 register
 *  NA
 */
typedef union {
    struct {
        /** block_ts : R/W; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t block_ts: 22;
        uint32_t reserved_22: 10;
    };
    uint32_t val;
} dmac_chn_block_ts0_reg_t;

/** Type of chn_ctl0 register
 *  NA
 */
typedef union {
    struct {
        /** sms : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t sms: 1;
        uint32_t reserved_1: 1;
        /** dms : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t dms: 1;
        uint32_t reserved_3: 1;
        /** sinc : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t sinc: 1;
        uint32_t reserved_5: 1;
        /** dinc : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t dinc: 1;
        uint32_t reserved_7: 1;
        /** src_tr_width : R/W; bitpos: [10:8]; default: 2;
         *  NA
         */
        uint32_t src_tr_width: 3;
        /** dst_tr_width : R/W; bitpos: [13:11]; default: 2;
         *  NA
         */
        uint32_t dst_tr_width: 3;
        /** src_msize : R/W; bitpos: [17:14]; default: 0;
         *  NA
         */
        uint32_t src_msize: 4;
        /** dst_msize : R/W; bitpos: [21:18]; default: 0;
         *  NA
         */
        uint32_t dst_msize: 4;
        /** ar_cache : R/W; bitpos: [25:22]; default: 0;
         *  NA
         */
        uint32_t ar_cache: 4;
        /** aw_cache : R/W; bitpos: [29:26]; default: 0;
         *  NA
         */
        uint32_t aw_cache: 4;
        /** nonposted_lastwrite_en : R/W; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t nonposted_lastwrite_en: 1;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} dmac_chn_ctl0_reg_t;

