espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dw_gdma_struct.h
/** Type of chn_ctl1 register
 *  NA
 */
typedef union {
    struct {
        /** ar_prot : R/W; bitpos: [2:0]; default: 0;
         *  NA
         */
        uint32_t ar_prot: 3;
        /** aw_prot : R/W; bitpos: [5:3]; default: 0;
         *  NA
         */
        uint32_t aw_prot: 3;
        /** arlen_en : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t arlen_en: 1;
        /** arlen : R/W; bitpos: [14:7]; default: 0;
         *  NA
         */
        uint32_t arlen: 8;
        /** awlen_en : R/W; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t awlen_en: 1;
        /** awlen : R/W; bitpos: [23:16]; default: 0;
         *  NA
         */
        uint32_t awlen: 8;
        /** src_stat_en : R/W; bitpos: [24]; default: 0;
         *  NA
         */
        uint32_t src_stat_en: 1;
        /** dst_stat_en : R/W; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t dst_stat_en: 1;
        /** ioc_blktfr : R/W; bitpos: [26]; default: 0;
         *  NA
         */
        uint32_t ioc_blktfr: 1;
        uint32_t reserved_27: 3;
        /** shadowreg_or_lli_last : R/W; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t shadowreg_or_lli_last: 1;
        /** shadowreg_or_lli_valid : R/W; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t shadowreg_or_lli_valid: 1;
    };
    uint32_t val;
} dmac_chn_ctl1_reg_t;

/** Type of chn_cfg0 register
 *  NA
 */
typedef union {
    struct {
        /** src_multblk_type : R/W; bitpos: [1:0]; default: 0;
         *  NA
         */
        uint32_t src_multblk_type: 2;
        /** dst_multblk_type : R/W; bitpos: [3:2]; default: 0;
         *  NA
         */
        uint32_t dst_multblk_type: 2;
        uint32_t reserved_4: 14;
        /** rd_uid : RO; bitpos: [21:18]; default: 0;
         *  NA
         */
        uint32_t rd_uid: 4;
        uint32_t reserved_22: 3;
        /** wr_uid : RO; bitpos: [28:25]; default: 0;
         *  NA
         */
        uint32_t wr_uid: 4;
        uint32_t reserved_29: 3;
    };
    uint32_t val;
} dmac_chn_cfg0_reg_t;

/** Type of chn_cfg1 register
 *  NA
 */
typedef union {
    struct {
        /** tt_fc : R/W; bitpos: [2:0]; default: 3;
         *  NA
         */
        uint32_t tt_fc: 3;
        /** hs_sel_src : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t hs_sel_src: 1;
        /** hs_sel_dst : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t hs_sel_dst: 1;
        /** src_hwhs_pol : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t src_hwhs_pol: 1;
        /** dst_hwhs_pol : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t dst_hwhs_pol: 1;
        /** src_per : R/W; bitpos: [8:7]; default: 0;
         *  NA
         */
        uint32_t src_per: 2;
        uint32_t reserved_9: 3;
        /** dst_per : R/W; bitpos: [13:12]; default: 0;
         *  NA
         */
        uint32_t dst_per: 2;
        uint32_t reserved_14: 3;
        /** ch_prior : R/W; bitpos: [19:17]; default: 3;
         *  NA
         */
        uint32_t ch_prior: 3;
        /** lock_ch : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t lock_ch: 1;
        /** lock_ch_l : RO; bitpos: [22:21]; default: 0;
         *  NA
         */
        uint32_t lock_ch_l: 2;
        /** src_osr_lmt : R/W; bitpos: [26:23]; default: 0;
         *  NA
         */
        uint32_t src_osr_lmt: 4;
        /** dst_osr_lmt : R/W; bitpos: [30:27]; default: 0;
         *  NA
         */
        uint32_t dst_osr_lmt: 4;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} dmac_chn_cfg1_reg_t;

/** Type of chn_llp0 register
 *  NA
 */
typedef union {
    struct {
        /** lms : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t lms: 1;
        uint32_t reserved_1: 5;
        /** loc0 : R/W; bitpos: [31:6]; default: 0;
         *  NA
         */
        uint32_t loc0: 26;
    };
    uint32_t val;
} dmac_chn_llp0_reg_t;

/** Type of chn_llp1 register
 *  NA
 */
typedef union {
    struct {
        /** loc1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t loc1: 32;
    };
    uint32_t val;
} dmac_chn_llp1_reg_t;

/** Type of chn_swhssrc0 register
 *  NA
 */
typedef union {
    struct {
        /** swhs_req_src : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t swhs_req_src: 1;
        /** swhs_req_src_we : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t swhs_req_src_we: 1;
        /** swhs_sglreq_src : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t swhs_sglreq_src: 1;
        /** swhs_sglreq_src_we : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t swhs_sglreq_src_we: 1;
        /** swhs_lst_src : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t swhs_lst_src: 1;
        /** swhs_lst_src_we : WO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t swhs_lst_src_we: 1;
        uint32_t reserved_6: 26;
    };
    uint32_t val;
} dmac_chn_swhssrc0_reg_t;

/** Type of chn_swhsdst0 register
 *  NA
 */
typedef union {
    struct {
        /** swhs_req_dst : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t swhs_req_dst: 1;
        /** swhs_req_dst_we : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t swhs_req_dst_we: 1;
        /** swhs_sglreq_dst : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t swhs_sglreq_dst: 1;
        /** swhs_sglreq_dst_we : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t swhs_sglreq_dst_we: 1;
        /** swhs_lst_dst : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t swhs_lst_dst: 1;
        /** swhs_lst_dst_we : WO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t swhs_lst_dst_we: 1;
        uint32_t reserved_6: 26;
    };
    uint32_t val;
} dmac_chn_swhsdst0_reg_t;

/** Type of chn_blk_tfr_resumereq0 register
 *  NA
 */
typedef union {
    struct {
        /** blk_tfr_resumereq : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t blk_tfr_resumereq: 1;
        uint32_t reserved_1: 31;
    };
    uint32_t val;
} dmac_chn_blk_tfr_resumereq0_reg_t;

