espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dw_gdma_struct.h
/** Type of chn_axi_id0 register
 *  NA
 */
typedef union {
    struct {
        /** axi_read_id_suffix : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t axi_read_id_suffix: 1;
        uint32_t reserved_1: 15;
        /** axi_write_id_suffix : R/W; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t axi_write_id_suffix: 1;
        uint32_t reserved_17: 15;
    };
    uint32_t val;
} dmac_chn_axi_id0_reg_t;

/** Type of chn_axi_qos0 register
 *  NA
 */
typedef union {
    struct {
        /** axi_awqos : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t axi_awqos: 4;
        /** axi_arqos : R/W; bitpos: [7:4]; default: 0;
         *  NA
         */
        uint32_t axi_arqos: 4;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} dmac_chn_axi_qos0_reg_t;

/** Group: Interrupt Registers */
/** Type of intstatus0 register
 *  NA
 */
typedef union {
    struct {
        /** ch1_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ch1_intstat: 1;
        /** ch2_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ch2_intstat: 1;
        /** ch3_intstat : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ch3_intstat: 1;
        /** ch4_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ch4_intstat: 1;
        uint32_t reserved_4: 12;
        /** commonreg_intstat : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t commonreg_intstat: 1;
        uint32_t reserved_17: 15;
    };
    uint32_t val;
} dmac_intstatus0_reg_t;

/** Type of commonreg_intclear0 register
 *  NA
 */
typedef union {
    struct {
        /** clear_slvif_commonreg_dec_err_intstat : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_dec_err_intstat: 1;
        /** clear_slvif_commonreg_wr2ro_err_intstat : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_wr2ro_err_intstat: 1;
        /** clear_slvif_commonreg_rd2wo_err_intstat : WO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_rd2wo_err_intstat: 1;
        /** clear_slvif_commonreg_wronhold_err_intstat : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_wronhold_err_intstat: 1;
        uint32_t reserved_4: 3;
        /** clear_slvif_commonreg_wrparity_err_intstat : WO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_commonreg_wrparity_err_intstat: 1;
        /** clear_slvif_undefinedreg_dec_err_intstat : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_undefinedreg_dec_err_intstat: 1;
        /** clear_mxif1_rch0_eccprot_correrr_intstat : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch0_eccprot_correrr_intstat: 1;
        /** clear_mxif1_rch0_eccprot_uncorrerr_intstat : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch0_eccprot_uncorrerr_intstat: 1;
        /** clear_mxif1_rch1_eccprot_correrr_intstat : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch1_eccprot_correrr_intstat: 1;
        /** clear_mxif1_rch1_eccprot_uncorrerr_intstat : WO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_rch1_eccprot_uncorrerr_intstat: 1;
        /** clear_mxif1_bch_eccprot_correrr_intstat : WO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_bch_eccprot_correrr_intstat: 1;
        /** clear_mxif1_bch_eccprot_uncorrerr_intstat : WO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t clear_mxif1_bch_eccprot_uncorrerr_intstat: 1;
        /** clear_mxif2_rch0_eccprot_correrr_intstat : WO; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch0_eccprot_correrr_intstat: 1;
        /** clear_mxif2_rch0_eccprot_uncorrerr_intstat : WO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch0_eccprot_uncorrerr_intstat: 1;
        /** clear_mxif2_rch1_eccprot_correrr_intstat : WO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch1_eccprot_correrr_intstat: 1;
        /** clear_mxif2_rch1_eccprot_uncorrerr_intstat : WO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_rch1_eccprot_uncorrerr_intstat: 1;
        /** clear_mxif2_bch_eccprot_correrr_intstat : WO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_bch_eccprot_correrr_intstat: 1;
        /** clear_mxif2_bch_eccprot_uncorrerr_intstat : WO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t clear_mxif2_bch_eccprot_uncorrerr_intstat: 1;
        uint32_t reserved_21: 11;
    };
    uint32_t val;
} dmac_commonreg_intclear0_reg_t;

/** Type of commonreg_intstatus_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** enable_slvif_commonreg_dec_err_intstat : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_dec_err_intstat: 1;
        /** enable_slvif_commonreg_wr2ro_err_intstat : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wr2ro_err_intstat: 1;
        /** enable_slvif_commonreg_rd2wo_err_intstat : R/W; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_rd2wo_err_intstat: 1;
        /** enable_slvif_commonreg_wronhold_err_intstat : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wronhold_err_intstat: 1;
        uint32_t reserved_4: 3;
        /** enable_slvif_commonreg_wrparity_err_intstat : RO; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wrparity_err_intstat: 1;
        /** enable_slvif_undefinedreg_dec_err_intstat : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_undefinedreg_dec_err_intstat: 1;
        /** enable_mxif1_rch0_eccprot_correrr_intstat : RO; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_correrr_intstat: 1;
        /** enable_mxif1_rch0_eccprot_uncorrerr_intstat : RO; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_uncorrerr_intstat: 1;
        /** enable_mxif1_rch1_eccprot_correrr_intstat : RO; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_correrr_intstat: 1;
        /** enable_mxif1_rch1_eccprot_uncorrerr_intstat : RO; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_uncorrerr_intstat: 1;
        /** enable_mxif1_bch_eccprot_correrr_intstat : RO; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_correrr_intstat: 1;
        /** enable_mxif1_bch_eccprot_uncorrerr_intstat : RO; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_uncorrerr_intstat: 1;
        /** enable_mxif2_rch0_eccprot_correrr_intstat : RO; bitpos: [15]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_correrr_intstat: 1;
        /** enable_mxif2_rch0_eccprot_uncorrerr_intstat : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_uncorrerr_intstat: 1;
        /** enable_mxif2_rch1_eccprot_correrr_intstat : RO; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_correrr_intstat: 1;
        /** enable_mxif2_rch1_eccprot_uncorrerr_intstat : RO; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_uncorrerr_intstat: 1;
        /** enable_mxif2_bch_eccprot_correrr_intstat : RO; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_correrr_intstat: 1;
        /** enable_mxif2_bch_eccprot_uncorrerr_intstat : RO; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_uncorrerr_intstat: 1;
        uint32_t reserved_21: 11;
    };
    uint32_t val;
} dmac_commonreg_intstatus_enable0_reg_t;

/** Type of commonreg_intsignal_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** enable_slvif_commonreg_dec_err_intsignal : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_dec_err_intsignal: 1;
        /** enable_slvif_commonreg_wr2ro_err_intsignal : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wr2ro_err_intsignal: 1;
        /** enable_slvif_commonreg_rd2wo_err_intsignal : R/W; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_rd2wo_err_intsignal: 1;
        /** enable_slvif_commonreg_wronhold_err_intsignal : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wronhold_err_intsignal: 1;
        uint32_t reserved_4: 3;
        /** enable_slvif_commonreg_wrparity_err_intsignal : RO; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_commonreg_wrparity_err_intsignal: 1;
        /** enable_slvif_undefinedreg_dec_err_intsignal : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_undefinedreg_dec_err_intsignal: 1;
        /** enable_mxif1_rch0_eccprot_correrr_intsignal : RO; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_correrr_intsignal: 1;
        /** enable_mxif1_rch0_eccprot_uncorrerr_intsignal : RO; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch0_eccprot_uncorrerr_intsignal: 1;
        /** enable_mxif1_rch1_eccprot_correrr_intsignal : RO; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_correrr_intsignal: 1;
        /** enable_mxif1_rch1_eccprot_uncorrerr_intsignal : RO; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_rch1_eccprot_uncorrerr_intsignal: 1;
        /** enable_mxif1_bch_eccprot_correrr_intsignal : RO; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_correrr_intsignal: 1;
        /** enable_mxif1_bch_eccprot_uncorrerr_intsignal : RO; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t enable_mxif1_bch_eccprot_uncorrerr_intsignal: 1;
        /** enable_mxif2_rch0_eccprot_correrr_intsignal : RO; bitpos: [15]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_correrr_intsignal: 1;
        /** enable_mxif2_rch0_eccprot_uncorrerr_intsignal : RO; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch0_eccprot_uncorrerr_intsignal: 1;
        /** enable_mxif2_rch1_eccprot_correrr_intsignal : RO; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_correrr_intsignal: 1;
        /** enable_mxif2_rch1_eccprot_uncorrerr_intsignal : RO; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_rch1_eccprot_uncorrerr_intsignal: 1;
        /** enable_mxif2_bch_eccprot_correrr_intsignal : RO; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_correrr_intsignal: 1;
        /** enable_mxif2_bch_eccprot_uncorrerr_intsignal : RO; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t enable_mxif2_bch_eccprot_uncorrerr_intsignal: 1;
        uint32_t reserved_21: 11;
    };
    uint32_t val;
} dmac_commonreg_intsignal_enable0_reg_t;

