espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dw_gdma_struct.h
/** Type of chn_intstatus_enable1 register
 *  NA
 */
typedef union {
    struct {
        /** enable_ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_chmem_correrr_intstat: 1;
        /** enable_ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_chmem_uncorrerr_intstat: 1;
        /** enable_ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_uidmem_correrr_intstat: 1;
        /** enable_ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_uidmem_uncorrerr_intstat: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} dmac_chn_intstatus_enable1_reg_t;

/** Type of chn_intstatus0 register
 *  NA
 */
typedef union {
    struct {
        /** block_tfr_done_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t block_tfr_done_intstat: 1;
        /** dma_tfr_done_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t dma_tfr_done_intstat: 1;
        uint32_t reserved_2: 1;
        /** src_transcomp_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t src_transcomp_intstat: 1;
        /** dst_transcomp_intstat : RO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t dst_transcomp_intstat: 1;
        /** src_dec_err_intstat : RO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t src_dec_err_intstat: 1;
        /** dst_dec_err_intstat : RO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t dst_dec_err_intstat: 1;
        /** src_slv_err_intstat : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t src_slv_err_intstat: 1;
        /** dst_slv_err_intstat : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t dst_slv_err_intstat: 1;
        /** lli_rd_dec_err_intstat : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t lli_rd_dec_err_intstat: 1;
        /** lli_wr_dec_err_intstat : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t lli_wr_dec_err_intstat: 1;
        /** lli_rd_slv_err_intstat : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t lli_rd_slv_err_intstat: 1;
        /** lli_wr_slv_err_intstat : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t lli_wr_slv_err_intstat: 1;
        /** shadowreg_or_lli_invalid_err_intstat : RO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t shadowreg_or_lli_invalid_err_intstat: 1;
        /** slvif_multiblktype_err_intstat : RO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t slvif_multiblktype_err_intstat: 1;
        uint32_t reserved_15: 1;
        /** slvif_dec_err_intstat : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t slvif_dec_err_intstat: 1;
        /** slvif_wr2ro_err_intstat : RO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t slvif_wr2ro_err_intstat: 1;
        /** slvif_rd2rwo_err_intstat : RO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t slvif_rd2rwo_err_intstat: 1;
        /** slvif_wronchen_err_intstat : RO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t slvif_wronchen_err_intstat: 1;
        /** slvif_shadowreg_wron_valid_err_intstat : RO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t slvif_shadowreg_wron_valid_err_intstat: 1;
        /** slvif_wronhold_err_intstat : RO; bitpos: [21]; default: 0;
         *  NA
         */
        uint32_t slvif_wronhold_err_intstat: 1;
        uint32_t reserved_22: 3;
        /** slvif_wrparity_err_intstat : RO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t slvif_wrparity_err_intstat: 1;
        uint32_t reserved_26: 1;
        /** ch_lock_cleared_intstat : RO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t ch_lock_cleared_intstat: 1;
        /** ch_src_suspended_intstat : RO; bitpos: [28]; default: 0;
         *  NA
         */
        uint32_t ch_src_suspended_intstat: 1;
        /** ch_suspended_intstat : RO; bitpos: [29]; default: 0;
         *  NA
         */
        uint32_t ch_suspended_intstat: 1;
        /** ch_disabled_intstat : RO; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t ch_disabled_intstat: 1;
        /** ch_aborted_intstat : RO; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t ch_aborted_intstat: 1;
    };
    uint32_t val;
} dmac_chn_intstatus0_reg_t;

/** Type of chn_intstatus1 register
 *  NA
 */
typedef union {
    struct {
        /** ecc_prot_chmem_correrr_intstat : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t ecc_prot_chmem_correrr_intstat: 1;
        /** ecc_prot_chmem_uncorrerr_intstat : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t ecc_prot_chmem_uncorrerr_intstat: 1;
        /** ecc_prot_uidmem_correrr_intstat : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t ecc_prot_uidmem_correrr_intstat: 1;
        /** ecc_prot_uidmem_uncorrerr_intstat : RO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t ecc_prot_uidmem_uncorrerr_intstat: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} dmac_chn_intstatus1_reg_t;

/** Type of chn_intsignal_enable0 register
 *  NA
 */
typedef union {
    struct {
        /** enable_block_tfr_done_intsignal : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_block_tfr_done_intsignal: 1;
        /** enable_dma_tfr_done_intsignal : R/W; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_dma_tfr_done_intsignal: 1;
        uint32_t reserved_2: 1;
        /** enable_src_transcomp_intsignal : R/W; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_src_transcomp_intsignal: 1;
        /** enable_dst_transcomp_intsignal : R/W; bitpos: [4]; default: 1;
         *  NA
         */
        uint32_t enable_dst_transcomp_intsignal: 1;
        /** enable_src_dec_err_intsignal : R/W; bitpos: [5]; default: 1;
         *  NA
         */
        uint32_t enable_src_dec_err_intsignal: 1;
        /** enable_dst_dec_err_intsignal : R/W; bitpos: [6]; default: 1;
         *  NA
         */
        uint32_t enable_dst_dec_err_intsignal: 1;
        /** enable_src_slv_err_intsignal : R/W; bitpos: [7]; default: 1;
         *  NA
         */
        uint32_t enable_src_slv_err_intsignal: 1;
        /** enable_dst_slv_err_intsignal : R/W; bitpos: [8]; default: 1;
         *  NA
         */
        uint32_t enable_dst_slv_err_intsignal: 1;
        /** enable_lli_rd_dec_err_intsignal : R/W; bitpos: [9]; default: 1;
         *  NA
         */
        uint32_t enable_lli_rd_dec_err_intsignal: 1;
        /** enable_lli_wr_dec_err_intsignal : R/W; bitpos: [10]; default: 1;
         *  NA
         */
        uint32_t enable_lli_wr_dec_err_intsignal: 1;
        /** enable_lli_rd_slv_err_intsignal : R/W; bitpos: [11]; default: 1;
         *  NA
         */
        uint32_t enable_lli_rd_slv_err_intsignal: 1;
        /** enable_lli_wr_slv_err_intsignal : R/W; bitpos: [12]; default: 1;
         *  NA
         */
        uint32_t enable_lli_wr_slv_err_intsignal: 1;
        /** enable_shadowreg_or_lli_invalid_err_intsignal : R/W; bitpos: [13]; default: 1;
         *  NA
         */
        uint32_t enable_shadowreg_or_lli_invalid_err_intsignal: 1;
        /** enable_slvif_multiblktype_err_intsignal : R/W; bitpos: [14]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_multiblktype_err_intsignal: 1;
        uint32_t reserved_15: 1;
        /** enable_slvif_dec_err_intsignal : R/W; bitpos: [16]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_dec_err_intsignal: 1;
        /** enable_slvif_wr2ro_err_intsignal : R/W; bitpos: [17]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_wr2ro_err_intsignal: 1;
        /** enable_slvif_rd2rwo_err_intsignal : R/W; bitpos: [18]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_rd2rwo_err_intsignal: 1;
        /** enable_slvif_wronchen_err_intsignal : R/W; bitpos: [19]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_wronchen_err_intsignal: 1;
        /** enable_slvif_shadowreg_wron_valid_err_intsignal : R/W; bitpos: [20]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_shadowreg_wron_valid_err_intsignal: 1;
        /** enable_slvif_wronhold_err_intsignal : R/W; bitpos: [21]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_wronhold_err_intsignal: 1;
        uint32_t reserved_22: 3;
        /** enable_slvif_wrparity_err_intsignal : RO; bitpos: [25]; default: 1;
         *  NA
         */
        uint32_t enable_slvif_wrparity_err_intsignal: 1;
        uint32_t reserved_26: 1;
        /** enable_ch_lock_cleared_intsignal : R/W; bitpos: [27]; default: 1;
         *  NA
         */
        uint32_t enable_ch_lock_cleared_intsignal: 1;
        /** enable_ch_src_suspended_intsignal : R/W; bitpos: [28]; default: 1;
         *  NA
         */
        uint32_t enable_ch_src_suspended_intsignal: 1;
        /** enable_ch_suspended_intsignal : R/W; bitpos: [29]; default: 1;
         *  NA
         */
        uint32_t enable_ch_suspended_intsignal: 1;
        /** enable_ch_disabled_intsignal : R/W; bitpos: [30]; default: 1;
         *  NA
         */
        uint32_t enable_ch_disabled_intsignal: 1;
        /** enable_ch_aborted_intsignal : R/W; bitpos: [31]; default: 1;
         *  NA
         */
        uint32_t enable_ch_aborted_intsignal: 1;
    };
    uint32_t val;
} dmac_chn_intsignal_enable0_reg_t;

