espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dw_gdma_struct.h
/** Type of chn_intsignal_enable1 register
 *  NA
 */
typedef union {
    struct {
        /** enable_ecc_prot_chmem_correrr_intsignal : RO; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_chmem_correrr_intsignal: 1;
        /** enable_ecc_prot_chmem_uncorrerr_intsignal : RO; bitpos: [1]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_chmem_uncorrerr_intsignal: 1;
        /** enable_ecc_prot_uidmem_correrr_intsignal : RO; bitpos: [2]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_uidmem_correrr_intsignal: 1;
        /** enable_ecc_prot_uidmem_uncorrerr_intsignal : RO; bitpos: [3]; default: 1;
         *  NA
         */
        uint32_t enable_ecc_prot_uidmem_uncorrerr_intsignal: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} dmac_chn_intsignal_enable1_reg_t;

/** Type of chn_intclear0 register
 *  NA
 */
typedef union {
    struct {
        /** clear_block_tfr_done_intstat : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t clear_block_tfr_done_intstat: 1;
        /** clear_dma_tfr_done_intstat : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t clear_dma_tfr_done_intstat: 1;
        uint32_t reserved_2: 1;
        /** clear_src_transcomp_intstat : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t clear_src_transcomp_intstat: 1;
        /** clear_dst_transcomp_intstat : WO; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t clear_dst_transcomp_intstat: 1;
        /** clear_src_dec_err_intstat : WO; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t clear_src_dec_err_intstat: 1;
        /** clear_dst_dec_err_intstat : WO; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t clear_dst_dec_err_intstat: 1;
        /** clear_src_slv_err_intstat : WO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t clear_src_slv_err_intstat: 1;
        /** clear_dst_slv_err_intstat : WO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t clear_dst_slv_err_intstat: 1;
        /** clear_lli_rd_dec_err_intstat : WO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t clear_lli_rd_dec_err_intstat: 1;
        /** clear_lli_wr_dec_err_intstat : WO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t clear_lli_wr_dec_err_intstat: 1;
        /** clear_lli_rd_slv_err_intstat : WO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t clear_lli_rd_slv_err_intstat: 1;
        /** clear_lli_wr_slv_err_intstat : WO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t clear_lli_wr_slv_err_intstat: 1;
        /** clear_shadowreg_or_lli_invalid_err_intstat : WO; bitpos: [13]; default: 0;
         *  NA
         */
        uint32_t clear_shadowreg_or_lli_invalid_err_intstat: 1;
        /** clear_slvif_multiblktype_err_intstat : WO; bitpos: [14]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_multiblktype_err_intstat: 1;
        uint32_t reserved_15: 1;
        /** clear_slvif_dec_err_intstat : WO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_dec_err_intstat: 1;
        /** clear_slvif_wr2ro_err_intstat : WO; bitpos: [17]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_wr2ro_err_intstat: 1;
        /** clear_slvif_rd2rwo_err_intstat : WO; bitpos: [18]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_rd2rwo_err_intstat: 1;
        /** clear_slvif_wronchen_err_intstat : WO; bitpos: [19]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_wronchen_err_intstat: 1;
        /** clear_slvif_shadowreg_wron_valid_err_intstat : WO; bitpos: [20]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_shadowreg_wron_valid_err_intstat: 1;
        /** clear_slvif_wronhold_err_intstat : WO; bitpos: [21]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_wronhold_err_intstat: 1;
        uint32_t reserved_22: 3;
        /** clear_slvif_wrparity_err_intstat : WO; bitpos: [25]; default: 0;
         *  NA
         */
        uint32_t clear_slvif_wrparity_err_intstat: 1;
        uint32_t reserved_26: 1;
        /** clear_ch_lock_cleared_intstat : WO; bitpos: [27]; default: 0;
         *  NA
         */
        uint32_t clear_ch_lock_cleared_intstat: 1;
        /** clear_ch_src_suspended_intstat : WO; bitpos: [28]; default: 0;
         *  NA
         */
        uint32_t clear_ch_src_suspended_intstat: 1;
        /** clear_ch_suspended_intstat : WO; bitpos: [29]; default: 0;
         *  NA
         */
        uint32_t clear_ch_suspended_intstat: 1;
        /** clear_ch_disabled_intstat : WO; bitpos: [30]; default: 0;
         *  NA
         */
        uint32_t clear_ch_disabled_intstat: 1;
        /** clear_ch_aborted_intstat : WO; bitpos: [31]; default: 0;
         *  NA
         */
        uint32_t clear_ch_aborted_intstat: 1;
    };
    uint32_t val;
} dmac_chn_intclear0_reg_t;

/** Type of chn_intclear1 register
 *  NA
 */
typedef union {
    struct {
        /** clear_ecc_prot_chmem_correrr_intstat : WO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t clear_ecc_prot_chmem_correrr_intstat: 1;
        /** clear_ecc_prot_chmem_uncorrerr_intstat : WO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t clear_ecc_prot_chmem_uncorrerr_intstat: 1;
        /** clear_ecc_prot_uidmem_correrr_intstat : WO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t clear_ecc_prot_uidmem_correrr_intstat: 1;
        /** clear_ecc_prot_uidmem_uncorrerr_intstat : WO; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t clear_ecc_prot_uidmem_uncorrerr_intstat: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} dmac_chn_intclear1_reg_t;

/** Group: Status Registers */
/** Type of chn_status0 register
 *  NA
 */
typedef union {
    struct {
        /** cmpltd_blk_tfr_size : RO; bitpos: [21:0]; default: 0;
         *  NA
         */
        uint32_t cmpltd_blk_tfr_size: 22;
        uint32_t reserved_22: 10;
    };
    uint32_t val;
} dmac_chn_status0_reg_t;

/** Type of chn_status1 register
 *  NA
 */
typedef union {
    struct {
        /** data_left_in_fifo : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t data_left_in_fifo: 15;
        uint32_t reserved_15: 17;
    };
    uint32_t val;
} dmac_chn_status1_reg_t;

