espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dw_gdma_struct.h
/** Type of chn_sstat0 register
 *  NA
 */
typedef union {
    struct {
        /** sstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t sstat: 32;
    };
    uint32_t val;
} dmac_chn_sstat0_reg_t;

/** Type of chn_dstat0 register
 *  NA
 */
typedef union {
    struct {
        /** dstat : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dstat: 32;
    };
    uint32_t val;
} dmac_chn_dstat0_reg_t;

/** Type of chn_sstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** sstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t sstatar0: 32;
    };
    uint32_t val;
} dmac_chn_sstatar0_reg_t;

/** Type of chn_sstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** sstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t sstatar1: 32;
    };
    uint32_t val;
} dmac_chn_sstatar1_reg_t;

/** Type of chn_dstatar0 register
 *  NA
 */
typedef union {
    struct {
        /** dstatar0 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dstatar0: 32;
    };
    uint32_t val;
} dmac_chn_dstatar0_reg_t;

/** Type of chn_dstatar1 register
 *  NA
 */
typedef union {
    struct {
        /** dstatar1 : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t dstatar1: 32;
    };
    uint32_t val;
} dmac_chn_dstatar1_reg_t;

typedef struct {
    volatile dmac_chn_sar0_reg_t sar0;
    volatile dmac_chn_sar1_reg_t sar1;
    volatile dmac_chn_dar0_reg_t dar0;
    volatile dmac_chn_dar1_reg_t dar1;
    volatile dmac_chn_block_ts0_reg_t block_ts0;
    uint32_t reserved_114;
    volatile dmac_chn_ctl0_reg_t ctl0;
    volatile dmac_chn_ctl1_reg_t ctl1;
    volatile dmac_chn_cfg0_reg_t cfg0;
    volatile dmac_chn_cfg1_reg_t cfg1;
    volatile dmac_chn_llp0_reg_t llp0;
    volatile dmac_chn_llp1_reg_t llp1;
    volatile dmac_chn_status0_reg_t status0;
    volatile dmac_chn_status1_reg_t status1;
    volatile dmac_chn_swhssrc0_reg_t swhssrc0;
    uint32_t reserved_13c;
    volatile dmac_chn_swhsdst0_reg_t swhsdst0;
    uint32_t reserved_144;
    volatile dmac_chn_blk_tfr_resumereq0_reg_t blk_tfr_resumereq0;
    uint32_t reserved_14c;
    volatile dmac_chn_axi_id0_reg_t axi_id0;
    uint32_t reserved_154;
    volatile dmac_chn_axi_qos0_reg_t axi_qos0;
    uint32_t reserved_15c;
    volatile dmac_chn_sstat0_reg_t sstat0;
    uint32_t reserved_164;
    volatile dmac_chn_dstat0_reg_t dstat0;
    uint32_t reserved_16c;
    volatile dmac_chn_sstatar0_reg_t sstatar0;
    volatile dmac_chn_sstatar1_reg_t sstatar1;
    volatile dmac_chn_dstatar0_reg_t dstatar0;
    volatile dmac_chn_dstatar1_reg_t dstatar1;
    volatile dmac_chn_intstatus_enable0_reg_t int_st_ena0;
    volatile dmac_chn_intstatus_enable1_reg_t int_st_ena1;
    volatile dmac_chn_intstatus0_reg_t int_st0;
    volatile dmac_chn_intstatus1_reg_t int_st1;
    volatile dmac_chn_intsignal_enable0_reg_t int_sig_ena0;
    volatile dmac_chn_intsignal_enable1_reg_t int_sig_ena1;
    volatile dmac_chn_intclear0_reg_t int_clr0;
    volatile dmac_chn_intclear1_reg_t int_clr1;
    uint32_t reserved_1a0[24];
} dmac_channel_reg_t;

typedef struct dw_gdma_dev_t {
    volatile dmac_id0_reg_t id0;
    uint32_t reserved_004;
    volatile dmac_compver0_reg_t compver0;
    uint32_t reserved_00c;
    volatile dmac_cfg0_reg_t cfg0;
    uint32_t reserved_014;
    volatile dmac_chen0_reg_t chen0;
    volatile dmac_chen1_reg_t chen1;
    uint32_t reserved_020[4];
    volatile dmac_intstatus0_reg_t int_st0;
    uint32_t reserved_034;
    volatile dmac_commonreg_intclear0_reg_t common_int_clr0;
    uint32_t reserved_03c;
    volatile dmac_commonreg_intstatus_enable0_reg_t common_int_st_ena0;
    uint32_t reserved_044;
    volatile dmac_commonreg_intsignal_enable0_reg_t common_int_sig_ena0;
    uint32_t reserved_04c;
    volatile dmac_commonreg_intstatus0_reg_t common_int_st0;
    uint32_t reserved_054;
    volatile dmac_reset0_reg_t reset0;
    uint32_t reserved_05c;
    volatile dmac_lowpower_cfg0_reg_t lowpower_cfg0;
    volatile dmac_lowpower_cfg1_reg_t lowpower_cfg1;
    uint32_t reserved_068[38];
    volatile dmac_channel_reg_t ch[4];
} dw_gdma_dev_t;

extern dw_gdma_dev_t DW_GDMA;

#ifndef __cplusplus
_Static_assert(sizeof(dw_gdma_dev_t) == 0x500, "Invalid size of dw_gdma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
